Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
/**
  ******************************************************************************
  * @file    lrwan_ns1_atcmd.c
  * @author  MCD Application Team
  * @brief   at command API
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "stm32l1xx_hal.h"
#include <stdio.h>
#include "lrwan_ns1_atcmd.h"
#include "hw.h"

#define ATCTL_WAKEUP    0
#define CMD_DEBUG 1

/*Globle variables------------------------------------------------------------*/
uint32_t record_num = 0;
uint8_t atctl_dl_buf[256];
char LoRa_AT_Cmd_Buff[DATA_TX_MAX_BUFF_SIZE];    /* Buffer used for AT cmd transmission */
char response[DATA_RX_MAX_BUFF_SIZE];   /*not only for return code but also for return value: exemple KEY*/

/* Private functions ---------------------------------------------------------*/
static atctl_ret_t atctl_parse(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_at(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_ver(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_vdd(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_msg(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_join(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_mode(char *buf, int len, atctl_data_t *dt);

static HAL_StatusTypeDef at_cmd_send(uint16_t len);

static uint8_t at_cmd_format(ATCmd_t Cmd, void *ptr, Marker_t Marker);

static atctl_ret_t atctl_statu(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_addr(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_eui(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_key(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_laddr(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_value(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_string(char *buf, int len, atctl_data_t *dt);
static atctl_ret_t atctl_channel(char *buf, int len, atctl_data_t *dt);

ATCmd_t FLAG_Cmd;
/* Private variables ---------------------------------------------------------*/
static uint16_t Offset = 0;   /*write position needed for sendb command*/
static uint8_t aRxBuffer[5];  /* Buffer used for Rx input character */
static const atctl_cmd_list_t atctl_cmd_list[] =
{
    {AT,             "AT",         			  atctl_at},
    {AT_LADDR,       "LADDR",    				  atctl_laddr},
    {AT_NAME,        "NAME",      			  atctl_string},
    {AT_ADVI,        "ADVI",    					atctl_value},
    {AT_UUID,        "UUID",    		      atctl_value},
    {AT_ADVD,        "ADVD",   					  atctl_string},
    {AT_SCAN_STD,    "SACN_STD",     		  atctl_statu},
    {AT_SCAN_NAME,   "SACN_NAME",    			atctl_string},
    {AT_SCAN_RSSI,   "SACN_RSSI",         atctl_value},

    {AT_SLEEP,       "SLEEP",       		  atctl_statu},
    {AT_BAUD,        "BAUD",        		  atctl_value},
    {AT_ATE,         "ATE",         			atctl_statu},

    {AT_DEVEUI,      "DEVEUI",       		  atctl_eui},
    {AT_APPEUI,      "APPEUI",      		  atctl_eui},
    {AT_APPKEY,      "APPKEY",      		  atctl_key},
    {AT_NWKSKEY,     "NWKSKEY",     		  atctl_key},
    {AT_APPSKEY,     "APPSKEY",     		  atctl_key},
    {AT_DADDR,       "DEVADDR",     		  atctl_addr},
    {AT_JOIN_MODE,   "JOIN_MODE",    		  atctl_mode},
    {AT_CLASS,       "CLASS",     			  atctl_msg},
    {AT_JOINING,     "JOINING",    			  atctl_join},
    {AT_JOIN_STD,    "JOIN_STD",    		  atctl_join},
    {AT_AUTO_JOIN,   "AUTO_JOIN",    		  atctl_statu},
    {AT_NWKID,       "NWKID",     				NULL},

    {AT_TXLEN,       "TXLEN",      		    atctl_value},
    {AT_SENDB,       "SENDB",     		    NULL},
    {AT_SEND,        "SEND",      			  NULL},
    {AT_RECVB,       "RECVB",     			  atctl_msg},
    {AT_RECV,        "RECV",       			  atctl_msg},
    {AT_CFM,         "CONFIRM",        		atctl_statu},
    {AT_UP_CNT,      "UP_CNT",            atctl_value},
    {AT_DOWN_CNT,    "DOWN_CNT",          atctl_value},

    {AT_ADR,         "ADR",          	    atctl_statu},
    {AT_TXP,         "TX_POWR",           atctl_value},
    {AT_DR,      	 "DR",        	      atctl_value},
    {AT_CH,          "CH",         		    atctl_channel},
    {AT_DUTY,    	 "DUTY_CYCLE",        atctl_value},
    {AT_RX2FQ,       "RX2FQ",     	      atctl_value},
    {AT_RX2DR,       "RX2DR",             atctl_value},
    {AT_RX1DL,       "RX1DL",      			  atctl_value},
    {AT_RX2DL,       "DX2DL",       			atctl_value},
    {AT_JN1DL,       "JN_RX1DL",    			atctl_value},
    {AT_JN2DL,       "JN_RX2DL",   			  atctl_value},
    {AT_REGION,      "REGION",            atctl_string},

    {AT_VER,         "VER",          			atctl_ver},
    {AT_SNR,         "SNR",               atctl_value},
    {AT_RSSI,        "RSSI",              atctl_value},
    {AT_BAT,         "BAT",          		  atctl_vdd},

    {AT_MC,          "MC",                atctl_statu},
    {AT_MC_DADDR,    "MC_DEVADDR",        atctl_addr},
    {AT_MC_NSKEY,    "MC_NWKSKEY",        atctl_key},
    {AT_MC_ASKEY,    "MC_APPSKEY",        atctl_key},
    {AT_MC_CNT,      "MC_CNT",            atctl_value},

    {AT_RESET,       "RESET",             atctl_at},
    {AT_FACTORY,     "FACTORY",           atctl_at},

    {AT_TEST,        "TEST",              atctl_statu},
    {AT_TEST_TXLR,   "TEST_TXLORA",       NULL},
    {AT_TEST_RXLR,   "TEST_RXLORA",       NULL},
    {AT_TEST_CFG,    "TEST_CONF",         NULL},
    {AT_TEST_SCAN,   "TEST_SCAN",         NULL},
    {AT_TEST_PIO0,   "TEST_PIO0",         NULL},
    {AT_TEST_PIO1,   "TEST_PIO1",         NULL},
    {AT_TEST_BLE,    "TEST_BLE_CON",      NULL},
};

static const struct atctl_msg_str
{
    const char *info;
    atctl_msg_sta_t type;
} atctl_msg_str[] =
{
    {"Start",                               ATCTL_MSG_START},
    {"Done",                                ATCTL_MSG_DONE},
    {"LoRaWAN modem is busy",               ATCTL_MSG_BUSY},

    {"TX ",                                 ATCTL_MSG_TX},
    {"Wait ACK",                            ATCTL_MSG_WAIT_ACK},
    {"PORT",                                ATCTL_MSG_RX},
    {"RXWIN",                               ATCTL_MSG_RXWIN},
    {"MACCMD",                              ATCTL_MSG_MACCMD},

