Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
    {"Network joined",                      ATCTL_MSG_JOINED},
    {"Joined already",                      ATCTL_MSG_JOIN_ALREADY},
    {"NORMAL",                              ATCTL_MSG_JOIN_NORMAL},
    {"FORCE",                               ATCTL_MSG_JOIN_FORCE},
    {"Join failed",                         ATCTL_MSG_JOIN_FAILED},
    {"NetID",                               ATCTL_MSG_JOIN_NETID},
    {"Not in OTAA mode",                    ATCTL_MSG_JOIN_NOT_OTAA},

    {"Please join network first",           ATCTL_MSG_NO_NET},
    {"DR error",                            ATCTL_MSG_DR},
    {"Length error",                        ATCTL_MSG_LEN},
    {"No free channel",                     ATCTL_MSG_NO_CH},
    {"No band in",                          ATCTL_MSG_NO_BAND},
    {"ACK Received",                        ATCTL_MSG_ACK_RECEIVED},
};

static const struct band_str
{
    BandPlans_t BandPlan;
    const char *info;
} band_str[] =
{
    {EU868,                         "EU868"},
    {US915,                         "US915"},
    {US915HYBRID,                   "US915HYBRID"},
    {CN779,                         "CN779"},
    {EU433,                         "EU433"},
    {AU915,                         "AU915"},
    {AU915OLD,                      "AU915OLD"},
    {CN470,                         "CN470"},
    {AS923,                         "AS923"},
    {KR920,                         "KR920"},
    {IN865,                         "IN865"},
    {CN470PREQUEL,                  "CN470PREQUEL"},
    {STE920,                        "STE920"},
};

static atctl_sta_t atctl_sta;
static char atctl_rx_buf[ATCTL_CMD_BUF_SIZE];
static volatile int16_t atctl_rx_wr_index;
static uint8_t atctl_rx_tmp_buf[ATCTL_CMD_BUF_SIZE];
static volatile int16_t atctl_rx_tmp_wr_index, atctl_rx_tmp_rd_index, atctl_rx_tmp_cnt;

extern atctl_data_t dt;

/**************************************************************
* @brief  Parse the received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_parse(char *buf, int len, atctl_data_t *dt)
{
    int i, cmdlen;
//    i = sscanf((char *)buf, "%*sERROR(%d)", &dt->err);    
   
    if (0 == strncasecmp("ERROR", (char *)buf, 5))
    {	
        dt->err = buf[7];
        LOG_LUO("------>atctl_parse error%d \r\n", &dt->err);
        return ATCTL_RET_CMD_ERR;
    }
//	
    if(buf[0]=='+')	
	{
//		LOG_LUO("atctl_join :%s  %d \r\n", buf, len);
		for (i = 0; i < sizeof(atctl_cmd_list) / sizeof(atctl_cmd_list_t); i ++)
		{
			
			cmdlen = strlen(atctl_cmd_list[i].name);
//			LOG_LUO("atctl_join :  %s  %d \r\n", atctl_cmd_list[i].name, cmdlen);
			if (0 == strncasecmp(atctl_cmd_list[i].name, (char *)buf + 1, cmdlen))
			{
				LOG_LUO("------>atctl_parse %s %d \r\n",atctl_cmd_list[i].name,i);
				if (atctl_cmd_list[i].func == NULL)
				{
					return ATCTL_RET_CMD_OK;
				}
				return (atctl_cmd_list[i].func(buf, len, dt));
			}
		}
	}
	else 
	{
		return (atctl_cmd_list[0].func(buf, len, dt));
	}
    return ATCTL_RET_ERR;
}

/**************************************************************
* @brief  Parse the AT command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_at(char *buf, int len, atctl_data_t *dt)
{
    int i;
    uint8_t p[2];
	LOG_LUO("-------------atctl_at \r\n ");
	if(Find_String((unsigned char *)buf,(unsigned char *)"OK",2)!= -1)
		return ATCTL_RET_CMD_AT;
//    i = sscanf((char *)buf, "%*s %c%c", &p[0], &p[1]);
//    if (i == 2)
//    {
//        if (p[0] == 'O' && p[1] == 'K')
//        {
//            return ATCTL_RET_CMD_AT;
//        }
//    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+VER command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_ver(char *buf, int len, atctl_data_t *dt)
{
    int i;
    i = sscanf((char *)buf, "%*s %d.%d.%d", &dt->ver[0], &dt->ver[1], &dt->ver[2]);
    if (i == 3)
    {
        return ATCTL_RET_CMD_VER;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+VDD command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_vdd(char *buf, int len, atctl_data_t *dt)
{
    int i;
    struct
    {
        int integer;
        int fractional;
    } vdd;
    i = sscanf((char *)buf, "%*s %d.%dV", &vdd.integer, &vdd.fractional);
    if (i == 2)
    {
        dt->vdd = (float)vdd.integer + (float)vdd.fractional / 100.0;
        return ATCTL_RET_CMD_VDD;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+MODE command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_mode(char *buf, int len, atctl_data_t *dt)
{
    int i;
    char str_mode[4] = {0};
    char otaa_mode[] = "OTAA";
    char abp_mode[] = "ABP";
    i = sscanf((char *)buf, "%*s %s", str_mode);
    if (i == 1)
    {
        if (!memcmp(otaa_mode, str_mode, strlen(otaa_mode)))
        {
            dt->mode = 1;
        }
        else if (!memcmp(abp_mode, str_mode, strlen(abp_mode)))
        {
            dt->mode = 0;
        }
        return ATCTL_RET_CMD_MODE;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_channel(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int p[4];
    i = sscanf((char *)buf, "%*s %d-%d,%d", &p[0], &p[1], &p[2]);
    if (i == 3)
    {
        dt->channel.chn_l = p[0];
        dt->channel.chn_h = p[1];
        dt->channel.chn_max = p[2];
        return ATCTL_RET_CMD_AT;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+xxvalue command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_value(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int atctl_value = 0;

    i = sscanf((char *)buf, "%*s %d", &atctl_value);
    if (i == 1)
    {
        if (0 == strncasecmp(atctl_cmd_list[AT_ADVI].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_ADVI].name)))
            dt->ble.advi = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_UUID].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_UUID].name)))
            dt->ble.uuid = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_SCAN_RSSI].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_SCAN_RSSI].name)))
            dt->ble.scan_rssi = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_BAUD].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_BAUD].name)))
            dt->dev_param.uart_baud = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_TXLEN].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_TXLEN].name)))
            dt->dev_param.txlen = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_UP_CNT].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_UP_CNT].name)))
            dt->dev_param.ul_cnt = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_DOWN_CNT].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_DOWN_CNT].name)))
            dt->dev_param.dl_cnt = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_TXP].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_TXP].name)))
            dt->dev_param.txp = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_DR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_DR].name)))
            dt->dev_param.dr = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_DUTY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_DUTY].name)))
            dt->dev_param.duty = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_RX2FQ].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_RX2FQ].name)))
            dt->dev_param.rx2fq = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_RX2DR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_RX2DR].name)))
            dt->dev_param.rx2dr = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_RX1DL].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_RX1DL].name)))
            dt->dev_param.rx1dl = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_RX2DL].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_RX2DL].name)))
            dt->dev_param.rx2dl = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_JN1DL].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_JN1DL].name)))
            dt->dev_param.jrx1dl = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_JN2DL].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_JN2DL].name)))
            dt->dev_param.jrx2dl = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_SNR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_SNR].name)))
            dt->dev_param.snr = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_RSSI].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_RSSI].name)))
            dt->dev_param.rssi = atctl_value;
        else if (0 == strncasecmp(atctl_cmd_list[AT_MC_CNT].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_MC_CNT].name)))
            dt->mc.cnt = atctl_value;
        return ATCTL_RET_CMD_DELAY;
    }
    return ATCTL_RET_CMD_OK;
}


static atctl_ret_t atctl_string(char *buf, int len, atctl_data_t *dt)
{
    int i;
    char atctl_buf[20] = {0};
    
