Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
    i = sscanf((char *)buf, "%*s %s", atctl_buf);
	if(i==1)
	{
	 if (0 == strncasecmp(atctl_cmd_list[AT_NAME].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_NAME].name)))
	 {
		memset(dt->ble.name,0,sizeof(dt->ble.name));
        memcpy(dt->ble.name,atctl_buf,len-1);	 
	 }
        else if (0 == strncasecmp(atctl_cmd_list[AT_ADVD].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_ADVD].name)))
            	 {
		memset(dt->ble.advd,0,sizeof(dt->ble.advd));
        memcpy(dt->ble.advd,atctl_buf,len-1);	 
	 }
        else if (0 == strncasecmp(atctl_cmd_list[AT_SCAN_NAME].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_SCAN_NAME].name)))
           	 {
		memset(dt->ble.scan_name,0,sizeof(dt->ble.scan_name));
        memcpy(dt->ble.scan_name,atctl_buf,len-1);	 
	 }
        else if (0 == strncasecmp(atctl_cmd_list[AT_REGION].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_REGION].name)))
            	 {
		memset(dt->id.region,0,sizeof(dt->id.region));
        memcpy(dt->id.region,atctl_buf,len-1);	 
	 }
		 return ATCTL_RET_CMD_DELAY;
	}
	return ATCTL_RET_CMD_OK;
}
///**************************************************************
//* @brief  Parse the AT+DR command received data
//* @param  *buf: point to the data
//* @param  len: length of the data
//* @param  *dt: point to area used to store the parsed data
//* @retval LoRa return code
//**************************************************************/
//static atctl_ret_t atctl_dr(char *buf, int len, atctl_data_t *dt)
//{
//    int i;
//    int dr_value = 0;
//    uint8_t type_str[20] = {0};

//    i = sscanf((char *)buf, "%*s DR%d", (&dr_value));
//    if (i == 1)
//    {
//        dt->dr.dr_value = dr_value;
//        return ATCTL_RET_CMD_DR;
//    }

//    i = sscanf((char *)buf, "%*s %s", type_str);
//    if (i == 1)
//    {
//        /* need to do something about dr type */
//        return ATCTL_RET_CMD_DR;
//    }

//    i = sscanf((char *)buf, "%*s %*s %*s  %*s %s", type_str);
//    if (i == 1)
//    {
//        /* need to do something about dr type */
//        return ATCTL_RET_CMD_DR;
//    }

//    return ATCTL_RET_CMD_OK;
//}

///**************************************************************
//* @brief  Parse the AT+ID command received data
//* @param  *buf: point to the data
//* @param  len: length of the data
//* @param  *dt: point to area used to store the parsed data
//* @retval LoRa return code
//**************************************************************/
//static atctl_ret_t atctl_id(char *buf, int len, atctl_data_t *dt)
//{
//    int i;
//    int p[8];

//    i = sscanf((char *)buf, "%*s DevAddr, %02x:%02x:%02x:%02x", &p[0], &p[1], &p[2], &p[3]);
//    if (i == 4)
//    {
//        for (i = 0; i < 4; i ++)
//        {
//            dt->id.devaddr[i] = (uint8_t)p[i];
//        }
//        return ATCTL_RET_CMD_ID;
//    }

//    i = sscanf((char *)buf, "%*s DevEui, %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x", \
//               &p[0], &p[1], &p[2], &p[3], &p[4], &p[5], &p[6], &p[7]);
//    if (i == 8)
//    {
//        for (i = 0; i < 8; i ++)
//        {
//            dt->id.deveui[i] = (uint8_t)p[i];
//        }
//        return ATCTL_RET_CMD_ID;
//    }

//    i = sscanf((char *)buf, "%*s AppEui, %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x", \
//               &p[0], &p[1], &p[2], &p[3], &p[4], &p[5], &p[6], &p[7]);
//    if (i == 8)
//    {
//        for (i = 0; i < 8; i ++)
//        {
//            dt->id.appeui[i] = (uint8_t)p[i];
//        }
//        return ATCTL_RET_CMD_ID;
//    }

//    return ATCTL_RET_CMD_OK;
//}

/**************************************************************
* @brief  Parse the AT+xxEUI command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_eui(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int p[8];
	LOG_LUO("-------------atctl_eui \r\n ");
    i = sscanf((char *)buf, "%*s %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x", \
               &p[0], &p[1], &p[2], &p[3], &p[4], &p[5], &p[6], &p[7]);

    if (0 == strncasecmp(atctl_cmd_list[AT_DEVEUI].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_DEVEUI].name)))
    {
        if (i == 8)
        {
            for (i = 0; i < 8; i ++)
            {
                dt->id.deveui[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_CMD_ID;
        }
    }
    else if (0 == strncasecmp(atctl_cmd_list[AT_APPEUI].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_APPEUI].name)))
    {
        if (i == 8)
        {
            for (i = 0; i < 8; i ++)
            {
                dt->id.appeui[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_CMD_ID;
        }
    }

    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+xxADDR command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_addr(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int p[8];

    i = sscanf((char *)buf, "%*s %02x:%02x:%02x:%02x", &p[0], &p[1], &p[2], &p[3]);

    if (0 == strncasecmp(atctl_cmd_list[AT_DADDR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_DADDR].name)))
    {
        if (i == 4)
        {
            for (i = 0; i < 4; i ++)
            {
                dt->id.devaddr[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_CMD_ID;
        }
    }

    else if (0 == strncasecmp(atctl_cmd_list[AT_MC_DADDR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_MC_DADDR].name)))
    {
        if (i == 4)
        {
            for (i = 0; i < 4; i ++)
            {
                dt->mc.devaddr[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_CMD_ID;
        }
    }

    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+xxEUI command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_laddr(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int p[8];

    i = sscanf((char *)buf, "%*s %02x:%02x:%02x:%02x:%02x:%02x", \
               &p[0], &p[1], &p[2], &p[3], &p[4], &p[5]);

