Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
    if (i == 6)
    {
        for (i = 0; i < 6; i ++)
        {
            dt->ble.laddr[i] = (uint8_t)p[i];
        }
        return ATCTL_RET_CMD_ID;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+xxKEY command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_key(char *buf, int len, atctl_data_t *dt)
{
    int i;
    int p[16];

    i = sscanf((char *)buf, "%*s %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x", \
               &p[0], &p[1], &p[2], &p[3], &p[4], &p[5], &p[6], &p[7], &p[8], &p[9], &p[10], &p[11], &p[12], &p[13], &p[14], &p[15]);

    if (0 == strncasecmp(atctl_cmd_list[AT_APPKEY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_APPKEY].name)))
    {
        if (i == 16)
        {
            for (i = 0; i < 16; i ++)
            {
                dt->id.appkey[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_CMD_OK;
        }
    }

    else if (0 == strncasecmp(atctl_cmd_list[AT_NWKSKEY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_NWKSKEY].name)))
    {
        if (i == 16)
        {
            for (i = 0; i < 16; i ++)
            {
                dt->id.nwkskey[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_IDLE;
        }
    }
    else if (0 == strncasecmp(atctl_cmd_list[AT_APPSKEY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_APPSKEY].name)))
    {
        if (i == 16)
        {
            for (i = 0; i < 16; i ++)
            {
                dt->id.appskey[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_IDLE;
        }
    }
    else if (0 == strncasecmp(atctl_cmd_list[AT_MC_NSKEY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_MC_NSKEY].name)))
    {
        if (i == 16)
        {
            for (i = 0; i < 16; i ++)
            {
                dt->mc.nwkskey[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_IDLE;
        }
    }
    else if (0 == strncasecmp(atctl_cmd_list[AT_MC_ASKEY].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_MC_ASKEY].name)))
    {
        if (i == 16)
        {
            for (i = 0; i < 16; i ++)
            {
                dt->mc.appskey[i] = (uint8_t)p[i];
            }
            return ATCTL_RET_IDLE;
        }
    }

    return ATCTL_RET_CMD_OK;
}
/**************************************************************
* @brief  Parse the AT+XXSTD command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_statu(char *buf, int len, atctl_data_t *dt)
{
    int i;
    char str_mode[4] = {0};
    char on_mode[4] = "ON";
    char off_mode[4] = "OFF";
    int atctl_std = 0;

    i = sscanf((char *)buf, "%*s %s", str_mode);
    if (i == 1)
    {
        if (!memcmp(on_mode, str_mode, strlen(on_mode)))
        {
            atctl_std = 1;
        }
        else if (!memcmp(off_mode, str_mode, strlen(off_mode)))
        {
            atctl_std = 0;
        }
    if (0 == strncasecmp(atctl_cmd_list[AT_SCAN_STD].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_SCAN_STD].name)))
        dt->ble.scan_std = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_ATE].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_ATE].name)))
        dt->std.ate = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_CFM].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_CFM].name)))
        dt->std.cfm = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_ADR].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_ADR].name)))
        dt->std.adr = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_AUTO_JOIN].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_AUTO_JOIN].name)))
        dt->std.atuo_join = 0;
    else if (0 == strncasecmp(atctl_cmd_list[AT_MC].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_MC].name)))
        dt->mc.std = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_TEST].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_TEST].name)))
        dt->std.test = atctl_std;
    else if (0 == strncasecmp(atctl_cmd_list[AT_SLEEP].name, (char *)buf + 1, strlen(atctl_cmd_list[AT_SLEEP].name)))
        dt->std.sleep = atctl_std;
	        return ATCTL_RET_CMD_MODE;
    }
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+JOIN command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_join(char *buf, int len, atctl_data_t *dt)
{
	int i;
	char join_buf[4] = {0};
    char join_ok[8] = "JOINED";
	LOG_LUO("atctl_join :  %s  %d \r\n", buf, len);
	 i = sscanf((char *)buf, "%*s %s", join_buf);
    if (i == 1)
    {
        if (!memcmp(join_ok, join_buf, strlen(join_ok)))
        {
            dt->id.join_std = 1;
			return ATCTL_RET_CMD_JOIN;
        }
		else 
			dt->id.join_std = 0;	
	}
    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Parse the AT+MSG command received data
* @param  *buf: point to the data
* @param  len: length of the data
* @param  *dt: point to area used to store the parsed data
* @retval LoRa return code
**************************************************************/
static atctl_ret_t atctl_msg(char *buf, int len, atctl_data_t *dt)
{
    int i;
	char msg_ack[4] = "ACK";
    char recv_buf[256];
    int x0, x1, x2,x3;
    
	i = sscanf((char *)buf, "%*s %d:%d:%d:%d:%s", &x0,&x1,&x2,&x3,recv_buf);
    if (i == 5)
        {
			dt->dev_param.rssi = x0;
			dt->dev_param.snr = x1;
			dt->msg.port = x2;
			dt->msg.size = x3;
			if (!memcmp(msg_ack, recv_buf, strlen(msg_ack)))
				dt->msg.ack = true;
			else
				memcpy(dt->msg.buf,recv_buf,dt->msg.size);
            return ATCTL_RET_CMD_MSG;
        }

    return ATCTL_RET_CMD_OK;
}

/**************************************************************
* @brief  Reset the key variables of the atctl function
* @param  void
* @retval void
**************************************************************/
static void atctl_reset(void)
{
    atctl_sta = ATCTL_RX_HEAD;
    atctl_rx_wr_index = 0;
    atctl_rx_tmp_cnt = 0;
    atctl_rx_tmp_rd_index = atctl_rx_tmp_wr_index;
}

/**************************************************************
* @brief  Store the received data in some place base on the rule for easy parse
* @param  data: one byte received
* @retval void
**************************************************************/
static void atctl_rx_byte(uint8_t data)
{
    switch (atctl_sta)
    {
    case ATCTL_RX_HEAD:
        atctl_rx_buf[0] = data;
        if (atctl_rx_buf[0] == '+')
        {
            atctl_rx_wr_index = 1;
            atctl_sta = ATCTL_RX_CMD;
        }
        break;
    case ATCTL_RX_CMD:
        atctl_rx_buf[atctl_rx_wr_index++] = data;
        if (data == '\n')
        {
            atctl_sta = ATCTL_RX_DONE;
            atctl_rx_buf[atctl_rx_wr_index] = '\0';
        }
        else if ((data == '\t') || (data == '\r') || (data > 'a' && data <= 'z') || \
                 (data >= ' ' && data <= '~'))
        {

