Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
        }
        else
        {
            /** Unknow character */
            atctl_reset();
        }
        if ((atctl_rx_wr_index >= ATCTL_CMD_BUF_SIZE) && (atctl_sta != ATCTL_RX_DONE))
        {
            /** atmunication buffer overflow */
            atctl_reset();
        }
        break;
    case ATCTL_RX_DONE:
    case ATCTL_PARSE_DONE:
        /*save ongoing commands */
        if (atctl_rx_tmp_cnt < ATCTL_CMD_BUF_SIZE)
        {
            atctl_rx_tmp_buf[atctl_rx_tmp_wr_index++] = data;
            if (atctl_rx_tmp_wr_index == ATCTL_CMD_BUF_SIZE)
            {
                atctl_rx_tmp_wr_index = 0;
            }
            atctl_rx_tmp_cnt++;
        }
        break;
    }
}

///**************************************************************
//* @brief  Handle the input params
//* @retval length of buf
//**************************************************************/
//static int atctl_buf(char *buf, char *fmt, va_list ap)
//{
//    int i, d, ret, len;
//    char c, *s;
//    uint8_t *hbuf;
//    double f;

//    if (fmt == NULL)
//    {
//        return 0;
//    }
//    i = 0;
//    while (*fmt)
//    {
//        if (*fmt == '%')
//        {
//            fmt++;
//            switch (*fmt)
//            {
//            case 'd':
//                d = va_arg(ap, int);
//                ret = sprintf(buf + i, "%d", d);
//                i += ret;
//                break;
//            case 'x':
//            case 'X':
//                d = va_arg(ap, int);
//                ret = sprintf(buf + i, "%X", d);
//                i += ret;
//                break;
//            case 'h':
//                hbuf = va_arg(ap, uint8_t *);
//                len = va_arg(ap, int);
//                for (d = 0; d < len; d++)
//                {
//                    ret = sprintf(buf + i, "%02X", hbuf[d]);
//                    i += ret;
//                }
//                break;
//            case 's':
//                s = va_arg(ap, char *);
//                ret = sprintf(buf + i, "\"%s\"", s);
//                i += ret;
//                break;
//            case 'c':
//                c = (char)va_arg(ap, int);
//                ret = sprintf(buf + i, "%c", c);
//                i += ret;
//                break;
//            case 'f':
//                f = va_arg(ap, double);
//                ret = sprintf(buf + i, "%.3f", f);
//                i += ret;
//                break;
//            }
//            fmt++;
//        }
//        else
//        {
//            buf[i++] = *fmt++;
//        }
//    }

//    buf[i] = '\0';

//    return i;
//}

///**************************************************************
//* @brief  Send the command and receive
//* @param  *dt: atctl_data_t
//* @retval LoRa return code
//**************************************************************/
//atctl_ret_t atctl_tx(atctl_data_t *dt, ATCmd_t cmd, char *fmt, ...)
//{
//    char buf[256];
//    uint8_t wakeup_ch[4] = {0xFF, 0xFF, 0xFF, 0xFF};
//    va_list ap;
//    int i, len;
//    atctl_ret_t ret = ATCTL_RET_CMD_ERR;
//    HAL_StatusTypeDef HAL_Status;

//    for (i = 0; i < AT_MAX; i++)
//    {
//        if (cmd == atctl_cmd_list[i].cmd)
//        {
//            break;
//        }
//    }
//    if (i == AT_MAX)
//    {
//        return ATCTL_RET_ERR;
//    }

//    va_start(ap, fmt);
//    len = atctl_buf(buf, fmt, ap);
//    va_end(ap);

//    atctl_reset();

//    if (ATCTL_WAKEUP)
//    {
//        HAL_UART_Transmit(&huart1, wakeup_ch, strlen((char *)wakeup_ch), 5000);
//    }

//    memset(LoRa_AT_Cmd_Buff, 0x00, sizeof LoRa_AT_Cmd_Buff);

//    if ((len != 0) && (cmd != AT))
//    {
//        len = AT_VPRINTF("AT+%s=%s\r\n", atctl_cmd_list[i].name, buf);
//    }
//    else
//    {
//        if (cmd == AT)
//        {
//            len = AT_VPRINTF("AT\r\n");
//        }
//        else
//        {
//            len = AT_VPRINTF("AT+%s\r\n", atctl_cmd_list[i].name);
//        }
//    }

//    HAL_Status = at_cmd_send(len);
//    if (HAL_Status != HAL_OK)
//    {
//        return (ATCTL_RET_ERR); /*problem on UART transmission*/
//    }
//    if (cmd != AT_RESET)
//    {
//        ret = at_cmd_receive(cmd, dt);
//    }
//#if defined CMD_DEBUG
//    if (len)
//    {
//        at_printf_send((uint8_t *)LoRa_AT_Cmd_Buff, len);
//    }

//    if (response[0] != '\0')
//    {
//        at_printf_send((uint8_t *)response, strlen(response));
//    }
//#endif
//    return ret;
//}

/**************************************************************
* @brief  Parse the data stored in buffer
* @param  *dt: atctl_data_t
* @retval LoRa return code
**************************************************************/
atctl_ret_t atctl_rx(atctl_data_t *dt, int timeout)
{
    atctl_ret_t ret = ATCTL_RET_CMD_ERR;
    int curindex;

    if (timeout == 0)
    {
        if ((atctl_sta == ATCTL_RX_DONE) || ((atctl_sta == ATCTL_PARSE_DONE) && (atctl_rx_tmp_cnt > 0)))
        {
            timeout = ATCTL_RX_TIMEOUT;
        }
        else
        {
            return ATCTL_RET_IDLE;
        }
    }

    curindex = atctl_rx_wr_index;
    while (1)
    {
        if ((atctl_sta == ATCTL_PARSE_DONE) && (atctl_rx_tmp_cnt > 0))
        {
            __disable_irq();
            atctl_sta = ATCTL_RX_HEAD;
            while (atctl_rx_tmp_cnt > 0)
            {
                atctl_rx_byte(atctl_rx_tmp_buf[atctl_rx_tmp_rd_index++]);
                if (atctl_rx_tmp_rd_index == ATCTL_CMD_BUF_SIZE)
                {
                    atctl_rx_tmp_rd_index = 0;
                }
                atctl_rx_tmp_cnt--;
                if (atctl_sta == ATCTL_RX_DONE)
                {
                    break;
                }
            }
            __enable_irq();
        }
        else if (atctl_sta == ATCTL_RX_DONE)
        {
            atctl_sta = ATCTL_PARSE_DONE;
            ret = atctl_parse(atctl_rx_buf, atctl_rx_wr_index, dt);
            if (atctl_rx_tmp_cnt == 0)
            {
                atctl_sta = ATCTL_RX_HEAD;
            }
            return ret;
        }
        else if (atctl_sta == ATCTL_RX_HEAD)
        {
            return ret;
        }
        if (atctl_rx_wr_index > curindex)
        {
            curindex = atctl_rx_wr_index;
        }
    }
}

