Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
/******************************************************************************
* @brief  Configures modem UART interface.
* @param  None
* @retval AT_OK in case of success
* @retval AT_UART_LINK_ERROR in case of failure
*****************************************************************************/
//HAL_StatusTypeDef Modem_IO_Init(void)
//{
//  if (HW_UART_Modem_Init(BAUD_RATE) == HAL_OK)
//  {
//    return HAL_OK;
//  }
//  else
//  {
//    return HAL_ERROR;
//  }
//}


/******************************************************************************
* @brief  Deinitialise modem UART interface.
* @param  None
* @retval None
*****************************************************************************/
//void Modem_IO_DeInit(void)
//{
//  HAL_UART_MspDeInit(&huart2);
//  HAL_UART_MspDeInit(&huart1);
//}

/******************************************************************************
 * @brief  Handle the AT cmd following their Groupp type
 * @param  at_group AT group [control, set , get)
 *         Cmd AT command
 *         pdata pointer to the IN/OUT buffer
 * @retval module status
 *****************************************************************************/
ATEerror_t  Modem_AT_Cmd(ATGroup_t at_group, ATCmd_t Cmd, void *pdata,uint16_t timeout)
{
    ATEerror_t Status = ATCTL_RET_ERR;
    HAL_StatusTypeDef HAL_Status;
    uint16_t Len = 0;
    uint8_t wakeup_ch[4] = {0xFF, 0xFF, 0xFF, 0xFF};

    /*reset At_cmd buffer for each transmission*/
    memset(LoRa_AT_Cmd_Buff, 0x00, sizeof LoRa_AT_Cmd_Buff);

    atctl_reset();

//    if (ATCTL_WAKEUP)
//    {
//        HAL_UART_Transmit(&huart1, wakeup_ch, strlen((char *)wakeup_ch), 5000);
//    }
    
    switch (at_group)
    {
    case AT_CTRL:
    {
        Len = at_cmd_format(Cmd, NULL, CTRL_MARKER);
        HAL_Status = at_cmd_send(Len);
        if (HAL_Status != HAL_OK)
        {
            return (ATCTL_RET_ERR); /*problem on UART transmission*/
        }
        Status = at_cmd_receive(Cmd, &dt,timeout);
        break;
    }
    case AT_SET:
    {
        Len = at_cmd_format(Cmd, pdata, SET_MARKER);
        HAL_Status = at_cmd_send(Len);
        if (HAL_Status != HAL_OK)
        {
            return (ATCTL_RET_ERR); /*problem on UART transmission*/
        }
        Status = at_cmd_receive(Cmd, &dt,timeout);
        break;
    }
    case AT_GET:
    {
        Len = at_cmd_format(Cmd, pdata, GET_MARKER);
        HAL_Status = at_cmd_send(Len);
        if (HAL_Status != HAL_OK)
        {
            return (ATCTL_RET_ERR); /*problem on UART transmission*/
        }
        Status = at_cmd_receive(Cmd, &dt,timeout);
        break;
    }
    default:
        DBG_PRINTF("unknow group\n\r");
        break;

    } /*end switch(at_group)*/

//#if defined CMD_DEBUG
//    if (Len)
//    {
//        at_printf_send((uint8_t *)LoRa_AT_Cmd_Buff, Len);
//    }

//    if (response[0] != '\0')
//    {
//        at_printf_send((uint8_t *)response, strlen(response));
//    }
//#endif
    return Status;
}


/******************************************************************************
 * @brief  format the cmd in order to be send
 * @param  Cmd AT command
 *         ptr generic pointer to the IN/OUT buffer
 *         Marker to discriminate the Set from the Get
 * @retval length of the formated frame to be send
 *****************************************************************************/
static uint8_t at_cmd_format(ATCmd_t Cmd, void *ptr, Marker_t Marker)
{
    uint16_t len;      /*length of the formated command*/
    uint8_t *PtrValue; /*for IN/OUT buffer*/
    uint32_t value;    /*for 32_02X and 32_D*/
    uint8_t value_8;   /*for 8_D*/


    if(Marker == GET_MARKER) /*GET AT CMD*/
	{
		DBG_PRINTF("---GET_MARKER--->at_cmd_format : %s \n",CmdTab[Cmd]);
        len = AT_VPRINTF("%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_GET_MARKER, AT_TAIL);
	}
    else if(Marker == SET_MARKER)  /*SET AT CMD*/
    {
        switch (Cmd)
        {
        case AT:              /*NO SET supported*/
        case AT_LADDR:        /*NO SET supported*/
        case AT_NAME:         /*supported*/
        case AT_ADVI:          /*supported*/
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_UUID:     			/*supported*/
        case AT_ADVD:          /*supported*/
        case AT_SCAN_STD:          /*supported*/
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_SCAN_NAME:          /*supported*/
        case AT_SCAN_RSSI:          /*supported*/
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_SLEEP:          /*supported*/
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_BAUD:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_ATE:
            /*Format = FORMAT_8_D_PARAM;*/
			
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
			LOG_LUO("SET ATE: %d \r\n",value_8 );
            break;
        case AT_DEVEUI:
        case AT_APPEUI:
            /*Format = FORMAT_8_02X_PARAM;*/
            PtrValue = (uint8_t *)ptr;
            len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s",
                             AT_HEADER, CmdTab[Cmd], AT_COMMA,
                             PtrValue[0], AT_COLON, PtrValue[1], AT_COLON, PtrValue[2], AT_COLON,
                             PtrValue[3], AT_COLON, PtrValue[4], AT_COLON, PtrValue[5], AT_COLON,
                             PtrValue[6], AT_COLON, PtrValue[7], AT_TAIL);
            break;
        case AT_APPKEY:
        case AT_NWKSKEY:
        case AT_APPSKEY:
            /*Format = FORMAT_16_02X_PARAM;*/
            PtrValue = (uint8_t *) ptr;
            len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s",
                             AT_HEADER, CmdTab[Cmd], AT_COMMA,
                             PtrValue[0], AT_COLON, PtrValue[1], AT_COLON,
                             PtrValue[2], AT_COLON, PtrValue[3], AT_COLON,
                             PtrValue[4], AT_COLON, PtrValue[5], AT_COLON,
                             PtrValue[6], AT_COLON, PtrValue[7], AT_COLON,
                             PtrValue[8], AT_COLON, PtrValue[9], AT_COLON,
                             PtrValue[10], AT_COLON, PtrValue[11], AT_COLON,
                             PtrValue[12], AT_COLON, PtrValue[13], AT_COLON,
                             PtrValue[14], AT_COLON, PtrValue[15], AT_TAIL);
            break;
        case AT_DADDR:
            /*Format = FORMAT_32_02X_PARAM;*/
            value =  *(uint32_t *)ptr;
            if (Marker == SET_MARKER)
            {
                len = AT_VPRINTF("%s%s%s%02x%02x%02x%02x%s", AT_HEADER, CmdTab[Cmd], AT_COMMA,
                                 (unsigned)((unsigned char *)(&value))[3],
                                 (unsigned)((unsigned char *)(&value))[2],
                                 (unsigned)((unsigned char *)(&value))[1],
                                 (unsigned)((unsigned char *)(&value))[0], AT_TAIL);
            }
            break;
        case AT_JOIN_MODE:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ABP, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OTAA, AT_TAIL);
            }
            break;
        case AT_CLASS:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_CLASS_A, AT_TAIL);
            }
            else if (value_8 == 2)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_CLASS_C, AT_TAIL);
            }
            break;
        case AT_JOINING:
        case AT_JOIN_STD:  /*NO SET*/
        case AT_AUTO_JOIN:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_NWKID:
            /*Format = FORMAT_32_02X_PARAM;*/
            value =  *(uint32_t *)ptr;
            len = AT_VPRINTF("%s%s%s%02x%02x%02x%02x%s", AT_HEADER, CmdTab[Cmd], AT_COMMA,
                             (unsigned)((unsigned char *)(&value))[3],
                             (unsigned)((unsigned char *)(&value))[2],
                             (unsigned)((unsigned char *)(&value))[1],
                             (unsigned)((unsigned char *)(&value))[0], AT_TAIL);
            break;
        case AT_TXLEN:   /*NO SET*/
        case AT_SENDB:
			 if (Marker == SET_MARKER)
            {
			    Offset = AT_VPRINTF("%s%s%s%d%s%d%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER,((sSendDataBinary_t *)ptr)->Num,AT_COLON,((sSendDataBinary_t *)ptr)->Port,AT_COLON);
                unsigned i;
                for (i = 0; i < ((sSendDataBinary_t *)ptr)->DataSize; i++)
                {
                    Offset += AT_VPRINTF("%02x", ((sSendDataBinary_t *)ptr)->Buffer[i]);
                }
                Offset += AT_VPRINTF("%s", AT_TAIL);
                len = Offset;
                Offset = 0;
			}
			else {
                len = AT_VPRINTF("%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_GET_MARKER, AT_TAIL);
            }
            break;
        case AT_SEND:
        case AT_RECVB:
        {
            /*Format = FORMAT_BINARY_TEXT; */
            if (Marker == SET_MARKER)
            {
                Offset = AT_VPRINTF("%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER);
                unsigned i;
                for (i = 0; i < ((sSendDataBinary_t *)ptr)->DataSize; i++)
                {
                    Offset += AT_VPRINTF("%02x", ((sSendDataBinary_t *)ptr)->Buffer[i]);
                }
                Offset += AT_VPRINTF("%s", AT_TAIL);
                len = Offset;
                Offset = 0;
            }
            else
            {
                len = AT_VPRINTF("%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_GET_MARKER, AT_TAIL);
            }
            break;
        }
        case AT_RECV:
        {
            /*Format = FORMAT_PLAIN_TEXT;*/
            if (Marker == SET_MARKER)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, ((sSendDataBinary_t *)ptr)->Buffer, AT_TAIL);
            }
            else
            {
                len = AT_VPRINTF("%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_GET_MARKER, AT_TAIL);
            }
            break;
        }
        case AT_CFM:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_UP_CNT:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_DOWN_CNT:   /*NO SET*/
        case AT_ADR:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_TXP:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_DR:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, value, AT_TAIL);
            }
            break;
        case AT_CH:
        case AT_DUTY:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_COMMA, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_COMMA, AT_ON, AT_TAIL);
            }
            break;
        case AT_RX2FQ:
        case AT_RX2DR:
        case AT_RX1DL:
        case AT_RX2DL:
        case AT_JN1DL:
        case AT_JN2DL:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_COMMA, value, AT_TAIL);
            }
            break;
        case AT_REGION:
            /*Format = FORMAT_8_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value_8 =  *(uint8_t *)ptr;
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, band_str[value_8].info, AT_TAIL);
            }
            break;
        case AT_VER:	/*NO SET supported*/
        case AT_SNR:	/*NO SET supported*/
        case AT_RSSI:  /*NO SET supported*/
        case AT_BAT:   /*NO SET supported*/
        case AT_MC:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_MC_DADDR:
            /*Format = FORMAT_32_02X_PARAM;*/
            value =  *(uint32_t *)ptr;
            if (Marker == SET_MARKER)
            {
                len = AT_VPRINTF("%s%s%s%02x%02x%02x%02x%s", AT_HEADER, CmdTab[Cmd], AT_COMMA,
                                 (unsigned)((unsigned char *)(&value))[3],
                                 (unsigned)((unsigned char *)(&value))[2],
                                 (unsigned)((unsigned char *)(&value))[1],
                                 (unsigned)((unsigned char *)(&value))[0], AT_TAIL);
            }
            break;
        case AT_MC_NSKEY:
        case AT_MC_ASKEY:
            /*Format = FORMAT_16_02X_PARAM;*/
            PtrValue = (uint8_t *) ptr;
            len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s",
                             AT_HEADER, CmdTab[Cmd], AT_COMMA,
                             PtrValue[0], AT_COLON, PtrValue[1], AT_COLON,
                             PtrValue[2], AT_COLON, PtrValue[3], AT_COLON,
                             PtrValue[4], AT_COLON, PtrValue[5], AT_COLON,
                             PtrValue[6], AT_COLON, PtrValue[7], AT_COLON,
                             PtrValue[8], AT_COLON, PtrValue[9], AT_COLON,
                             PtrValue[10], AT_COLON, PtrValue[11], AT_COLON,
                             PtrValue[12], AT_COLON, PtrValue[13], AT_COLON,
                             PtrValue[14], AT_COLON, PtrValue[15], AT_TAIL);
            break;
        case AT_MC_CNT:
            /*Format = FORMAT_32_D_PARAM;*/
            if (Marker == SET_MARKER)
            {
                value =  *(uint32_t *)ptr;
                len = AT_VPRINTF("%s%s%s%u%s", AT_HEADER, CmdTab[Cmd], AT_COMMA, value, AT_TAIL);
            }
            break;
        case AT_RESET:  /*NO SET supported*/
        case AT_FACTORY:   /*NO SET supported*/
        case AT_TEST:
            /*Format = FORMAT_8_D_PARAM;*/
            value_8 =  *(uint8_t *)ptr;
            if (value_8 == 0)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_OFF, AT_TAIL);
            }
            else if (value_8 == 1)
            {
                len = AT_VPRINTF("%s%s%s%s%s", AT_HEADER, CmdTab[Cmd], AT_SET_MARKER, AT_ON, AT_TAIL);
            }
            break;
        case AT_TEST_TXLR:
        case AT_TEST_RXLR:
        case AT_TEST_CFG:
        case AT_TEST_SCAN:
        case AT_TEST_PIO0:
        case AT_TEST_PIO1:
        case AT_TEST_BLE:
            break;
        default:
            len = AT_VPRINTF("%s%s%s", AT_HEADER, CmdTab[Cmd], AT_TAIL);
            DBG_PRINTF("format not yet supported \n\r");
            break;
        } /*end switch(cmd)*/
    }
    else   /*GTR AT CMD*/
	{
		DBG_PRINTF("---CTRL_MARKER--->at_cmd_format : %s \n",CmdTab[Cmd]);
        len = AT_VPRINTF("%s%s%s", AT_HEADER, CmdTab[Cmd], AT_TAIL);
	}
    return len;
}

