Moko-MKL62ST-DT/DEMO-firmware/MKL62BA_STD/SI/MKL62BA_STD.si4project/Backup/lrwan_ns1_atcmd(6876).c
/******************************************************************************
* @brief This function sends an AT cmd to the slave device
* @param len: length of the AT cmd to be sent
* @retval HAL return code
******************************************************************************/
static HAL_StatusTypeDef at_cmd_send(uint16_t len)
{
    HAL_StatusTypeDef RetCode;

    /*transmit the command from master to slave*/
    RetCode = Usart2SendData_DMA((uint8_t *)LoRa_AT_Cmd_Buff, len);
	at_printf_send((uint8_t *)LoRa_AT_Cmd_Buff, len);
//  RetCode = HAL_UART_Transmit(&huart1, (uint8_t *)LoRa_AT_Cmd_Buff, len, 5000);
    return (RetCode);
}

/******************************************************************************
* @brief This function sends an AT cmd to debug in PC
* @param len: length of the AT cmd to be sent
* @retval HAL return code
******************************************************************************/
HAL_StatusTypeDef at_printf_send(uint8_t *buf, uint16_t len)
{
    HAL_StatusTypeDef RetCode;

    /*transmit the command from master to debug*/
    RetCode = Usart1SendData_DMA((uint8_t *)buf, len);
//  RetCode = HAL_UART_Transmit(&huart2, (uint8_t *)buf, len, 5000);
    return (RetCode);
}

/******************************************************************************
* @brief This function receives response from the slave device
* @param viod
* @retval LoRa return code
******************************************************************************/
atctl_ret_t at_cmd_receive_evt(void)
{
    uint8_t  ResponseComplete = 0;

    atctl_ret_t RetCode = ATCTL_RET_CMD_OK;
    uint32_t time_ms = 0;
    /*cleanup the response buffer*/
    memset(response, 0x00, sizeof(response));

    record_num = 0;

    return RetCode;
}

/******************************************************************************
* @brief This function receives response from the slave device and parse
* @param Cmd: command type
* @param *dt: atctl_data_t type
* @retval LoRa return code
******************************************************************************/
atctl_ret_t at_cmd_receive(ATCmd_t Cmd, atctl_data_t *dt,uint16_t response_timeout)
{
    uint8_t  ResponseComplete = 0;
    uint16_t i = 0;
    uint32_t time_cnt = 0;

    atctl_ret_t RetCode = ATCTL_RET_IDLE;
	atctl_sta = ATCTL_RX_HEAD;
	atctl_rx_wr_index = 0;
    /*cleanup the response buffer*/
    memset(atctl_rx_buf, 0x00, sizeof(atctl_rx_buf));
	memset(response, 0x00, sizeof(response));
	while(!ResponseComplete)
	{
		delay_ms(10);
		if(time_cnt>response_timeout)
		{
		   time_cnt=0;
		   ResponseComplete = 1;
	       break;
		}
		else time_cnt++;
		if(UsartType2.receive_flag)
		{
			atctl_rx_wr_index = UsartType2.rx_len; 
			memcpy(atctl_rx_buf, &UsartType2.usartDMA_rxBuf, atctl_rx_wr_index-2);
			UsartType2.rx_len=0;
			Usart1SendData_DMA((uint8_t *)atctl_rx_buf, atctl_rx_wr_index);
			memset(UsartType2.usartDMA_rxBuf, 0x00, sizeof(UsartType2.usartDMA_rxBuf));
			
			ResponseComplete = 1;
			UsartType2.receive_flag = 0;
			atctl_sta = ATCTL_PARSE_DONE;
			 LOG_LUO("Usart2RecvData_DMA:%s  %d  \r\n", atctl_rx_buf, atctl_rx_wr_index);
			RetCode = atctl_parse(atctl_rx_buf, atctl_rx_wr_index, dt);
			break;
		}
	}
//    if (atctl_sta == ATCTL_PARSE_DONE)
//    {	
//		memcpy(response, atctl_rx_buf, atctl_rx_wr_index);		
//        Usart1SendData_DMA((uint8_t *)response, atctl_rx_wr_index);
//        
//        LOG_LUO("Usart2RecvData_DMA:  %s  %d  %d \r\n", response, atctl_rx_wr_index,RetCode);
//    }
	LOG_LUO("----->RetCode :%d \r\n", RetCode);
    return (RetCode);
}


/******************************************************************************
* @brief format the AT frame to be sent to the modem (slave)
* @param pointer to the format string
* @retval len of the string to be sent
******************************************************************************/
uint16_t at_cmd_vprintf(const char *format, ...)
{
    va_list args;
    uint16_t len;

    va_start(args, format);

    len = tiny_vsnprintf_like(LoRa_AT_Cmd_Buff + Offset, sizeof(LoRa_AT_Cmd_Buff) - Offset, format, args);

    va_end(args);

    return len;
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
